read_verilog hw/gen/MemDemo.v
synth_ecp5
write_json mem.json
